## Quick start

In [2]:
import pandas as pd

In [3]:
mydataset = {
     'cars' : ['BMW','Volvo','Ford']
    # 'cars' : ['BMW', None, None]
    ,'passings' : [3, 7, 2]
}

In [4]:
pd.DataFrame(mydataset)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [5]:
myvar = pd.DataFrame(mydataset)

In [6]:
myvar

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [7]:
type(myvar)

pandas.core.frame.DataFrame

In [8]:
# 데이터 정보
myvar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   cars      3 non-null      object
 1   passings  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [9]:
# 통계 정보
myvar.describe()

       passings
count  3.000000
mean   4.000000
std    2.645751
min    2.000000
25%    2.500000
50%    3.000000
75%    5.000000
max    7.000000

In [10]:
myvar.describe(include='all')

       cars  passings
count     3  3.000000
unique    3       NaN
top     BMW       NaN
freq      1       NaN
mean    NaN  4.000000
std     NaN  2.645751
min     NaN  2.000000
25%     NaN  2.500000
50%     NaN  3.000000
75%     NaN  5.000000
max     NaN  7.000000

In [12]:
myvar.describe(include='object')

       cars
count     3
unique    3
top     BMW
freq      1